Tekla Open API Reference for Tekla Structures 2025
AngleDimensionAttributes.Type Property
 The type of the angle.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AngleTypes Type { get; set; }
Public Property Type As AngleTypes
	Get
	Set
Property Value
Type: AngleTypes
See Also
Reference
AngleDimensionAttributes Class
Tekla.Structures.Drawing Namespace